zhanglazhuan/NomadCast/debug/t_key/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# USB Serial/JTAG as console (Leisound V1 doesn't use UART0)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Leisound V1 has 16MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# FATFS (pulled in by default; configure to avoid build errors)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_TIMEOUT_MS=10000
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FATFS_USE_LABEL=y
